# PANDAS SERIE & DATAFRAME REVIEW

### **INDEX**

**(1) [Series](#1---PANDAS--Series---How-to-Create-From...)** 
     
**(2) [DataFrame](#2---PANDAS-DATAFRAME---Structure)**

**(3) [Conditional Selection](#3---Conditional-Selection-w/-DataFrame)**

**(4) [Set and Reset Index](#4---SET-AND-RESET-INDEX)**
 
**(5) [Missing Data](#5----MISSING-DATA)**

**(6) [Group By](#6----GROUP-BY)**

**(7) [Cross Section](#7---Multilevel-DataFrame---CROSS-SECTION)**

**(8) [Pivot Table](#8---PIVOT-TABLE)**

**(9) [Merging, Joinning and Concatenation](#9---MERGING,-JOINNING-and-CONCATENATION)**

## 1 - PANDAS  Series - How to Create From...

In [1]:
import pandas as pd

In [2]:
labels = ['a','b', 'c']

In [3]:
my_data = [10,20,30]

In [4]:
import numpy as np

arr = np.array(my_data)

In [5]:
dict = {'a':10, 'b':20, 'c':30}

#### FROM LISTS

In [6]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

#### FROM ARRAY

In [8]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [9]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

#### FROM DICTIONARY

In [10]:
pd.Series(dict)

a    10
b    20
c    30
dtype: int64

## 2 - PANDAS DATAFRAME - Structure

import matplotlib.pyplot as plt
%matplotlib inline
import pandas as pd

df = pd.DataFrame(data, index, columns)
df = pd.DataFrame(d   , i    , c)

In [11]:
# Creating Pandas DATAFRAME by passing Dictionary to Pandas Dataframe METHOD:
# Ice Cream Sale - Last 12 Sunny Days
# table style: https://pandas.pydata.org/pandas-docs/stable/user_guide/style.html

d = {'X': [215,325,185,332,406,522,412,614,544,421,445,408], 'Y': [14.2,16.4,11.9,15.2,18.5,22.1,19.4,25.1,23.4,18.1,22.6,17.2]}
df = pd.DataFrame(data=d)
df.index = ['1°_dia','2°_dia', '3°_dia','4°_dia','5°_dia','6°_dia','7°_dia','8°_dia','9°_dia','10°_dia','11°_dia','12°_dia']
df.columns = [  'Ice_Cream_Sales',  'Temperature_°C']
df

         Ice_Cream_Sales  Temperature_°C
1°_dia               215            14.2
2°_dia               325            16.4
3°_dia               185            11.9
4°_dia               332            15.2
5°_dia               406            18.5
6°_dia               522            22.1
7°_dia               412            19.4
8°_dia               614            25.1
9°_dia               544            23.4
10°_dia              421            18.1
11°_dia              445            22.6
12°_dia              408            17.2

## 3 - Conditional Selection w/ DataFrame

#### Simple Conditional

In [12]:
df[df>20]

         Ice_Cream_Sales  Temperature_°C
1°_dia               215             NaN
2°_dia               325             NaN
3°_dia               185             NaN
4°_dia               332             NaN
5°_dia               406             NaN
6°_dia               522            22.1
7°_dia               412             NaN
8°_dia               614            25.1
9°_dia               544            23.4
10°_dia              421             NaN
11°_dia              445            22.6
12°_dia              408             NaN

In [13]:
df[df['Temperature_°C']> 20]

         Ice_Cream_Sales  Temperature_°C
6°_dia               522            22.1
8°_dia               614            25.1
9°_dia               544            23.4
11°_dia              445            22.6

#### One_line Conditional Solution

Return a subset of DataFrame

There are 2 general formats for GRABBING ELEMENTS from a DataFrame:

DOUBLE BRACKET FORMAT
    df[line][column]
    
SINGLE BRACKET FORMAT
    df[line,column]
    
(w/ comma, this is least prone to error!)

#### Multiple Lines Solution

In [14]:
boolser = df['Temperature_°C']>23

In [15]:
result = df[boolser]

In [16]:
mycols = ['Temperature_°C', 'Ice_Cream_Sales']

In [17]:
result[mycols]

        Temperature_°C  Ice_Cream_Sales
8°_dia            25.1              614
9°_dia            23.4              544

#### Single Line

In [18]:
# Slicing w/ Double Bracket Fromat
# df[][]
# df[line][column]
# df[line][[pass_a_list_of_columns]]
# df[df[]>0][['','']]

df[df['Temperature_°C']>23][['Temperature_°C', 'Ice_Cream_Sales']]

        Temperature_°C  Ice_Cream_Sales
8°_dia            25.1              614
9°_dia            23.4              544

#### 2 - Multiple Condicional

### Python Use AND OR In Multiple Single Conditional

In [19]:
True and True

True

In [20]:
True and False

False

In [21]:
True or True

True

In [22]:
True or False

True

####  BUT here,
####  This Operation will return an ERROR :/

df[(df['Temperature_°C']>23) and (df['Temperature_°C']<26)]

#### INSTEAD,
#### use AMPERSAND (&) or PIPE( | ) as below:

In [23]:
df[(df['Temperature_°C']>23)  &  (df['Temperature_°C']<26)]

        Ice_Cream_Sales  Temperature_°C
8°_dia              614            25.1
9°_dia              544            23.4

In [24]:
df[(df['Temperature_°C']<14)  |  (df['Temperature_°C']>22)]

         Ice_Cream_Sales  Temperature_°C
3°_dia               185            11.9
6°_dia               522            22.1
8°_dia               614            25.1
9°_dia               544            23.4
11°_dia              445            22.6

## 4 - SET AND RESET INDEX

In [25]:
# Transform the old index into a column
resetted_df = df.reset_index()
resetted_df

      index  Ice_Cream_Sales  Temperature_°C
0    1°_dia              215            14.2
1    2°_dia              325            16.4
2    3°_dia              185            11.9
3    4°_dia              332            15.2
4    5°_dia              406            18.5
5    6°_dia              522            22.1
6    7°_dia              412            19.4
7    8°_dia              614            25.1
8    9°_dia              544            23.4
9   10°_dia              421            18.1
10  11°_dia              445            22.6
11  12°_dia              408            17.2

In [26]:
# return index column as real index 
resetted_df.set_index('index')

         Ice_Cream_Sales  Temperature_°C
index
1°_dia               215            14.2
2°_dia               325            16.4
3°_dia               185            11.9
4°_dia               332            15.2
5°_dia               406            18.5
6°_dia               522            22.1
7°_dia               412            19.4
8°_dia               614            25.1
9°_dia               544            23.4
10°_dia              421            18.1
11°_dia              445            22.6
12°_dia              408            17.2

## 5 -  MISSING DATA

In [27]:
# Creating DataFrame From Dictionary

dict = {
            'A':[1,2,np.nan],        
            'B':[5, np.nan, np.nan],
            'C':[1,2,3]
       }

In [28]:
df = pd.DataFrame(dict)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#### Note that the First Line ( 0 ) and the Last Column ( C ) are Complete!

In [29]:
# axis=0 is default
# Returning the First Line (0)
df.dropna()

     A    B  C
0  1.0  5.0  1

In [30]:
# Returning the Last Column (C)
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [31]:
# returning if the Column has at least 2 elements
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [32]:
df.fillna(value ='FILL_VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL_VALUE  2
2  FILL_VALUE  FILL_VALUE  3

In [33]:
# Filling the blank cells with the MEAN OF COLUMN 'A'
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [34]:
# Letting Pandas sort out how best to fill the table
df.ffill()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

## 6 -  GROUP BY

In [35]:
company = ['GOOG', 'GOOG', 'MSTF', 'MSTF', 'FB', 'FB']

In [36]:
person = ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah']

In [37]:
sales = [200,120,340,124,245,350]

In [38]:
df = pd.DataFrame()

In [39]:
df['company'] = company
df['person'] = person
df['sales'] = sales
df

  company   person  sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSTF      Amy    340
3    MSTF  Vanessa    124
4      FB     Carl    245
5      FB    Sarah    350

In [40]:
bycompany = df.groupby('company')

In [41]:
bycompany.sum()

         sales
company
FB         595
GOOG       320
MSTF       464

In [42]:
bycompany.std()

              sales
company
FB        74.246212
GOOG      56.568542
MSTF     152.735065

In [43]:
bycompany.count()

         person  sales
company
FB            2      2
GOOG          2      2
MSTF          2      2

In [44]:
bycompany.max()

          person  sales
company
FB         Sarah    350
GOOG         Sam    200
MSTF     Vanessa    340

In [45]:
bycompany.min()

          person  sales
company
FB          Carl    245
GOOG     Charlie    120
MSTF         Amy    124

In [46]:
bycompany.describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  297.5   74.246212  245.0  271.25  297.5  323.75  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSTF      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [47]:
bycompany.describe().transpose()

company              FB        GOOG        MSTF
sales count    2.000000    2.000000    2.000000
      mean   297.500000  160.000000  232.000000
      std     74.246212   56.568542  152.735065
      min    245.000000  120.000000  124.000000
      25%    271.250000  140.000000  178.000000
      50%    297.500000  160.000000  232.000000
      75%    323.750000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

## 7 - Multilevel DataFrame - CROSS SECTION

In [48]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [49]:
inside = [1,2,3,1,2,3]

In [50]:
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [51]:
df = pd.DataFrame(np.random.randn(6,2), hier_index, ['A', 'B'])

In [52]:
df

             A         B
G1 1  0.077136 -2.246918
   2  0.520129  0.735769
   3  0.243357 -0.885262
G2 1 -0.037516  1.427698
   2  0.450024 -0.221691
   3  0.227625 -1.350783

In [53]:
df.loc['G1']

          A         B
1  0.077136 -2.246918
2  0.520129  0.735769
3  0.243357 -0.885262

In [54]:
df.loc['G2']

          A         B
1 -0.037516  1.427698
2  0.450024 -0.221691
3  0.227625 -1.350783

In [55]:
df.loc['G2'].loc[1]

A   -0.037516
B    1.427698
Name: 1, dtype: float64

In [56]:
df.loc['G2'].loc[1][0]

-0.037516471292354185

In [57]:
df.index.names

FrozenList([None, None])

In [58]:
df.index.names = ['Groups', 'Num']

In [59]:
df

                   A         B
Groups Num
G1     1    0.077136 -2.246918
       2    0.520129  0.735769
       3    0.243357 -0.885262
G2     1   -0.037516  1.427698
       2    0.450024 -0.221691
       3    0.227625 -1.350783

In [60]:
df.xs(1, level='Num')

               A         B
Groups
G1      0.077136 -2.246918
G2     -0.037516  1.427698

In [61]:
df.xs(3, level='Num')

               A         B
Groups
G1      0.243357 -0.885262
G2      0.227625 -1.350783

## 8 - PIVOT TABLE

In [62]:
A = ["G2", "G2", "G2", "G2", "G2", "G1", "G1", "G1", "G1"]

In [63]:
B = [1, 1, 1, 2, 2, 1, 1, 2, 2]

In [64]:
C = [2, 1, 1, 2, 2, 1, 2, 2, 1]

In [65]:
D = [1, 2, 2, 1, 2, 1, 2, 1, 1]

In [66]:
E = [2, 1, 2, 2, 1, 1, 2, 2, 1]

In [67]:
df = pd.DataFrame()

In [68]:
df['A'] = A
df['B'] = B
df['C'] = C
df['D'] = D
df['E'] = E
df

    A  B  C  D  E
0  G2  1  2  1  2
1  G2  1  1  2  1
2  G2  1  1  2  2
3  G2  2  2  1  2
4  G2  2  2  2  1
5  G1  1  1  1  1
6  G1  1  2  2  2
7  G1  2  2  1  2
8  G1  2  1  1  1

In [69]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'], fill_value=0 )

C     1    2
A  B
G1 1  1  2.0
   2  1  1.0
G2 1  2  1.0
   2  0  1.5

In [70]:
#This example aggregates values by taking the sum.
table = pd.pivot_table(df, values='D', index=['A', 'B'],columns=['C'], aggfunc=np.sum, fill_value=0)

In [71]:
table

C     1  2
A  B
G1 1  1  2
   2  1  1
G2 1  4  1
   2  0  3

## 9 - MERGING, JOINNING and CONCATENATION

In [72]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'], 'A':['A0','A1','A2','A3'], 'B':['B0','B1','B2','B3'], })
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [73]:
right = pd.DataFrame({'key':['K0','K1','K2','K3'], 'A':['A4','A5','A6','A7'], 'B':['B4','B5','B6','B7'], })
right

  key   A   B
0  K0  A4  B4
1  K1  A5  B5
2  K2  A6  B6
3  K3  A7  B7

#### Merging

In [74]:
pd.merge(left,right,how='inner',on='key')

  key A_x B_x A_y B_y
0  K0  A0  B0  A4  B4
1  K1  A1  B1  A5  B5
2  K2  A2  B2  A6  B6
3  K3  A3  B3  A7  B7

#### Joinning

In [75]:
left.join(right, how='inner', lsuffix='_left', rsuffix='_right')

  key_left A_left B_left key_right A_right B_right
0       K0     A0     B0        K0      A4      B4
1       K1     A1     B1        K1      A5      B5
2       K2     A2     B2        K2      A6      B6
3       K3     A3     B3        K3      A7      B7

#### Concatenation

In [76]:
pd.concat([left, right])

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
0  K0  A4  B4
1  K1  A5  B5
2  K2  A6  B6
3  K3  A7  B7

In [77]:
pd.concat([left, right], axis=1)

  key   A   B key   A   B
0  K0  A0  B0  K0  A4  B4
1  K1  A1  B1  K1  A5  B5
2  K2  A2  B2  K2  A6  B6
3  K3  A3  B3  K3  A7  B7

In [78]:
print("I hope you enjoyed that lecture o/\nIf you find this post helpful, please click the applause button and subscribe to the page for more articles like this one.\nHave a Nice Day!")

I hope you enjoyed that lecture o/
If you find this post helpful, please click the applause button and subscribe to the page for more articles like this one.
Have a Nice Day!